JuanPBP03/fastbit-STM32-courses/MCU1/stm32f4xx_drivers/Src/I2C_tests/007I2C_master_rx_testing.c
/*
 * 007I2C_master_rx_testing.c
 *
 *  Created on: Jun 21, 2025
 *      Author: JuanP
 */



#include<stdio.h>
#include "stm32f407xx.h"


#define SLAVE_ADDR	0x68


uint8_t rcvbuff[32];


void delay()
{
	for(volatile int i = 0;i<320000;i++);
}

void userButtonInit(void)
{
	GPIO_Handle_t PortA;

	PortA.p_GPIOx = GPIOA;

	GPIO_PinConfig_t ButtonPin = {
		.pinNumber = GPIO_PIN_NO_0,
		.pinMode = GPIO_MODE_IN,
		.pinSpeed = GPIO_SPEED_HIGH,
		.pinPUPDCtrl = GPIO_PUPD_NONE
	};

	PortA.GPIO_PinConfig = ButtonPin;
	GPIO_PinInit(&PortA);
}

void I2C1_GPIOInits(void)
{
	GPIO_Handle_t I2CPins;
	I2CPins.p_GPIOx = GPIOB;

	GPIO_PinConfig_t SCL =
	{
			.pinNumber = 6,
			.pinMode = GPIO_MODE_ALTFN,
			.pinPUPDCtrl = GPIO_PUPD_UP,
			.pinOType = GPIO_OTYPE_ODRAIN,
			.pinSpeed = GPIO_SPEED_HIGH,
			.pinAltFnMode = GPIO_AF_I2C1to3
	};
	GPIO_PinConfig_t SDA =
	{
			.pinNumber = 9,
			.pinMode = GPIO_MODE_ALTFN,
			.pinPUPDCtrl = GPIO_PUPD_UP,
			.pinOType = GPIO_OTYPE_ODRAIN,
			.pinSpeed = GPIO_SPEED_HIGH,
			.pinAltFnMode = GPIO_AF_I2C1to3
	};
	I2CPins.GPIO_PinConfig = SCL;
	GPIO_PinInit(&I2CPins);
	I2CPins.GPIO_PinConfig = SDA;
	GPIO_PinInit(&I2CPins);
}

I2C_Handle_t hI2C1;


void I2C1_Inits(void)
{
	hI2C1.channel = I2C_CH1;
	hI2C1.instance = I2C1;

	I2C_Config_t config =
	{
			.Ack = I2C_ACK_ENABLE,
			.ClockSpeed = I2C_SPEED_STANDARD,
			.Mode = I2C_MODE_SM,
			.OwnAddr = 0x61,
			.DutyCycle = 0,
	};
	hI2C1.config = config;
	I2C_Init(&hI2C1);


}


int main(void)
{
	uint8_t commandcode;

	uint8_t len;

	printf("Application is running\n");
	I2C1_GPIOInits();
	I2C1_Inits();
	I2C_PeripheralControl(hI2C1.instance, ENABLE);
	userButtonInit();
	while(1){

		while(!GPIO_ReadPin(GPIOA, GPIO_PIN_NO_0));
		delay();

		commandcode = 0x51;

		I2C_MasterTx(&hI2C1, &commandcode, 1, SLAVE_ADDR, I2C_REPEAT_START);

		I2C_MasterRx(&hI2C1, &len, 1, SLAVE_ADDR, I2C_REPEAT_START);

		commandcode = 0x52;

		I2C_MasterTx(&hI2C1, &commandcode, 1, SLAVE_ADDR, I2C_REPEAT_START);

		I2C_MasterRx(&hI2C1, rcvbuff, len, SLAVE_ADDR, I2C_NO_REPEAT);

		rcvbuff[len+1] = '\0';

		printf("Data: %s", rcvbuff);
	}

	return 0;
}
